{
  "title":"What is React ?",
  "p1":"React.js was released by a software engineer working for Facebook – Jordane Walke in 2011. React is a JavaScript library focused on creating declarative user interfaces (UIs) using a component-based concept. It’s used for handling the view layer and can be used for web and mobile apps. React’s main goal is to be extensive, fast,  declarative, flexible, and simple. ",
  "p2":"React is not a framework, it is specifically a library.  The explanation for this is that React only deals with rendering UIs and reserves many things at the discretion of individual projects. The standard set of tools for creating an application using ReactJS is frequently called the stack.",
  "bnf":"Benefits",
  "bnft":"So the main question is why you should choose ReactJS as a frontend development stack while there are a lot of others. Here are some reasons:",
  "bn1h4":"Speedless.",
  "bn1Exp":"React allows developers to use individual parts of their application on both the client and server sides, and any changes they make will not affect the application’s logic. This makes the development process extremely fast.",
  "bn2h4":"Components support.",
  "bn2Exp":"The use of HTML tags and JS codes makes it easy to work with a huge dataset containing DOM. React acts as an intermediary that represents the DOM and helps you decide which component requires changes to get accurate results.",
  "bn3h4":"Easy to use and learn.",
  "bn3Exp":"ReactJS is incredibly user-friendly and makes any UI interactive. It also allows you to quickly and efficiently build applications, which is time-saving for clients and developers alike.",
  "bn4h4":"SEO Friendly.",
  "bn4Exp":"A common problem complained by most web developers is that traditional JavaScript frameworks often have problems with SEO.  ReactJS solves this problem by helping developers navigate different search engines easily through the fact that the ReactJS application can run on the server, and the virtual DOM renders and returns it to the browser as a  web page.",
  "bn5h4":"One-way Data Binding.",
  "bn5Exp":"One-way data-binding implies that absolutely anyone can trace all the changes that have been made to a segment of the data.  This is also one of the reasons that makes React so easy."
}