{
    "title": "ما هو React؟",
    "p1": "تم إصدار React.js بواسطة مهندس برمجيات يعمل في Facebook - Jordane Walke في عام 2011. React هي مكتبة JavaScript تركز على إنشاء واجهات مستخدم تعريفية (UIs) باستخدام مفهوم قائم على المكون. وهي تستخدم للتعامل مع العرض طبقة ويمكن استخدامها لتطبيقات الويب والجوّال. الهدف الرئيسي لـ React هو أن تكون شاملة وسريعة ومعلنة ومرنة وبسيطة. ",
    "p2": "React ليس إطار عمل ، إنه مكتبة على وجه التحديد. تفسير ذلك هو أن React تتعامل فقط مع عرض واجهات المستخدم وتحتفظ بالعديد من الأشياء وفقًا لتقدير المشروعات الفردية. المجموعة القياسية من الأدوات لإنشاء تطبيق باستخدام كثيرًا ما يُطلق على ReactJS اسم المكدس. ",
    "bnf": "فوائد",
    "bnft": "لذا فإن السؤال الرئيسي هو لماذا يجب عليك اختيار ReactJS كمكدس تطوير للواجهة الأمامية بينما هناك الكثير من الأسباب الأخرى. وإليك بعض الأسباب:",
    "bn1h4": "السرعة.",
    "bn1Exp": "يسمح React للمطورين باستخدام أجزاء فردية من تطبيقاتهم على جانبي العميل والخادم ، وأي تغييرات يجرونها لن تؤثر على منطق التطبيق. وهذا يجعل عملية التطوير سريعة للغاية.",
    "bn2h4": "دعم المكونات.",
    "bn2Exp": "استخدام علامات HTML وأكواد JS يجعل من السهل العمل مع مجموعة بيانات ضخمة تحتوي على DOM. تعمل React كوسيط يمثل DOM ويساعدك على تحديد المكون الذي يتطلب تغييرات للحصول على نتائج دقيقة.",
    "bn3h4": "سهل الاستخدام والتعلم.",
    "bn3Exp": "ReactJS سهل الاستخدام بشكل لا يصدق ويجعل أي واجهة مستخدم تفاعلية. كما يتيح لك إنشاء التطبيقات بسرعة وكفاءة ، مما يوفر الوقت للعملاء والمطورين على حد سواء.",
    "bn4h4": "ملائمة لتحسين محركات البحث.",
    "bn4Exp": "من المشاكل الشائعة التي اشتكى معظم مطوري الويب أن أطر عمل JavaScript التقليدية غالبًا ما تواجه مشاكل مع تحسين محركات البحث. يحل ReactJS هذه المشكلة من خلال مساعدة المطورين على التنقل في محركات البحث المختلفة بسهولة من خلال حقيقة أن تطبيق ReactJS يمكن تشغيله على الخادم ، و يعرض DOM الظاهري ويعيده إلى المتصفح كصفحة ويب. ",
    "bn5h4": "ربط بيانات أحادي الاتجاه.",
    "bn5Exp": "ربط البيانات أحادي الاتجاه يعني أنه يمكن لأي شخص على الإطلاق تتبع جميع التغييرات التي تم إجراؤها على جزء من البيانات. وهذا أيضًا أحد الأسباب التي تجعل React سهلة للغاية."
}
  